app/controllers/bars_controller.rb

INSERT INTO "bars" ("created_at", "description", "email", "lat", "long", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  	def create
  		@bar = Bar.create(bar_params)