app/controllers/challenges_controller.rb

INSERT INTO "challenges" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 11 Mar 2014 23:36:38 UTC +00:00], ["description", ""], ["name", ""], ["updated_at", Tue, 11 Mar 2014 23:36:38 UTC +00:00]]
---
  	def create
  		@challenge = Challenge.create(challenge_params)